{
  "id": "3a6bcb84-3627-4744-99c3-46584b9f2cce",
  "timestamp": "20250614_131731",
  "transcription": "[00:00:00] Guest-1: Good afternoon, everyone, and welcome to Fintech Plus, Sync's second quarter 2023 earnings call. I'm John Doe, CEO of Fintech Plus. We've had a stellar Q2 with a revenue of 125 million, a 25% increase year over year. Our gross profit margin stands at a solid 58% due in part to cost efficiencies gaining from our scalable business model.\n[00:00:27] Guest-1: Our EBITDA has surged to three 37.5 million, translating to a remarkable 30% EBITDA margin.\n[00:00:36] Guest-1: Our net income for the quarter rose to 16,000,000, which is a noteworthy increase from 10 million in Q 2/20/22. Our total addressable market has grown substantially thanks to the expansion of our high yield savings product line and the new robo advisor platform.\n[00:00:55] Guest-1: We've been diversifying our asset backed securities portfolio, investing heavily in collateralized debt obligations and residential mortgage-backed securities. We've also invested 25,000,000 in AAA rated corporate bonds, enhancing our risk adjusted returns.\n[00:01:13] Guest-1: As for a balance sheet, total assets reached 1.5 billion with total liabilities at 900 million, leaving us with a solid equity base of 600 million. Our debt to equity ratio stands at 1.5, a healthy figure considering our expansionary phase.\n[00:01:33] Guest-1: We continue to see substantial organic user growth with customer acquisition cost dropping by 15% and lifetime value growing by 25%.\n[00:01:45] Guest-1: Our LTVCAC ratio is at an impression impressive 3.5 per X.\n[00:01:54] Guest-1: In terms of risk management, we have a value at risk model in place with a 99% confidence level indicating that our maximum loss will not exceed 5 million in the next trading day. We've adopted A conservative approach to managing our leverage and have a healthy tier one capital ratio of 12.5%.\n[00:02:17] Guest-1: Our forecast for the coming quarter is positive. We expect revenue to be around 135 million and 8% quarter over quarter growth.\n[00:02:25] Guest-1: Driven primarily by our cutting edge blockchain solutions and AI driven predictive analytics.\n[00:02:33] Guest-1: We're also excited about the upcoming IPO of our Fintech subsidiary, Pay Plus, which we expect to raise 200 million, significantly bolstering our liquidity and paving the way for aggressive growth strategies. We thank our shareholders for their continued faith in us, and we look forward to an even more successful Q3. Thank you so much.\n[00:02:55] Unknown: \n[00:02:55] Unknown: ",
  "lines": [
    {
      "speaker": "Guest-1",
      "text": "Good afternoon, everyone, and welcome to Fintech Plus, Sync's second quarter 2023 earnings call. I'm John Doe, CEO of Fintech Plus. We've had a stellar Q2 with a revenue of 125 million, a 25% increase year over year. Our gross profit margin stands at a solid 58% due in part to cost efficiencies gaining from our scalable business model.",
      "offset": 8300000,
      "duration": 259200000,
      "start_time": "00:00:00"
    },
    {
      "speaker": "Guest-1",
      "text": "Our EBITDA has surged to three 37.5 million, translating to a remarkable 30% EBITDA margin.",
      "offset": 276000000,
      "duration": 82000000,
      "start_time": "00:00:27"
    },
    {
      "speaker": "Guest-1",
      "text": "Our net income for the quarter rose to 16,000,000, which is a noteworthy increase from 10 million in Q 2/20/22. Our total addressable market has grown substantially thanks to the expansion of our high yield savings product line and the new robo advisor platform.",
      "offset": 366300000,
      "duration": 173600000,
      "start_time": "00:00:36"
    },
    {
      "speaker": "Guest-1",
      "text": "We've been diversifying ou±r asset backed securities portfolio, investing heavily in collateralized debt obligations and residential mortgage-backed securities. We've also invested 25,000,000 in AAA rated corporate bonds, enhancing our risk adjusted returns.",
      "offset": 551500000,
      "duration": 164800000,
      "start_time": "00:00:55"
    },
    {
      "speaker": "Guest-1",
      "text": "As for a balance sheet, total assets reached 1.5 billion with total liabilities at 900 million, leaving us with a solid equity base of 600 million. Our debt to equity ratio stands at 1.5, a healthy figure considering our expansionary phase.",
      "offset": 737100000,
      "duration": 182800000,
      "start_time": "00:01:13"
    },
    {
      "speaker": "Guest-1",
      "text": "We continue to see substantial organic user growth with customer acquisition cost dropping by 15% and lifetime value growing by 25%.",
      "offset": 931500000,
      "duration": 108400000,
      "start_time": "00:01:33"
    },
    {
      "speaker": "Guest-1",
      "text": "Our LTVCAC ratio is at an impression impressive 3.5 per X.",
      "offset": 1056400000,
      "duration": 62400000,
      "start_time": "00:01:45"
    },
    {
      "speaker": "Guest-1",
      "text": "In terms of risk management, we have a value at risk model in place with a 99% confidence level indicating that our maximum loss will not exceed 5 million in the next trading day. We've adopted A conservative approach to managing our leverage and have a healthy tier one capital ratio of 12.5%.",
      "offset": 1143500000,
      "duration": 210800000,
      "start_time": "00:01:54"
    },
    {
      "speaker": "Guest-1",
      "text": "Our forecast for the coming quarter is positive. We expect revenue to be around 135 million and 8% quarter over quarter growth.",
      "offset": 1375600000,
      "duration": 78000000,
      "start_time": "00:02:17"
    },
    {
      "speaker": "Guest-1",
      "text": "Driven primarily by our cutting edge blockchain solutions and AI driven predictive analytics.",
      "offset": 1458700000,
      "duration": 60400000,
      "start_time": "00:02:25"
    },
    {
      "speaker": "Guest-1",
      "text": "We're also excited about the upcoming IPO of our Fintech subsidiary, Pay Plus, which we expect to raise 200 million, significantly bolstering our liquidity and paving the way for aggressive growth strategies. We thank our shareholders for their continued faith in us, and we look forward to an even more successful Q3. Thank you so much.",
      "offset": 1532300000,
      "duration": 218400000,
      "start_time": "00:02:33"
    },
    {
      "speaker": "Unknown",
      "text": "",
      "offset": 1750700000,
      "duration": 8800000,
      "start_time": "00:02:55"
    },
    {
      "speaker": "Unknown",
      "text": "",
      "offset": 1759500000,
      "duration": 0,
      "start_time": "00:02:55"
    }
  ],
  "abstract_summary": null,
  "key_points": [],
  "action_items": [],
  "sentiment": null,
  "attachment": []
}